update: generate documentation
